let agreement =
`
<pre class="agreement-p">
    欢迎进入星若云云手机平台！
    星若云云手机平台（包括但不限于以APP形式提供的操作环境、微信公众号、小程序、网站等）为福州星若网络科技有限公司负责运营的依托于移动内容的云计算平台。星若云云手机平台用户使用许可协议（以下简称“本协议”）由您和福州星若网络科技有限公司（以下称 “星若公司”或“我方”）共同认可签署,本协议内容包括条款正文、 福州星若网络科技有限公司已经发布的或将来可能发布的各类规则。请您于注册或使用本服务前，仔细阅读并完全理解本服务条款的全部内容，其中用粗字体予以标注的，是与您的权益有关或可能具有重大关系，及对本网站具有或可能具有免责或限制责任的条款。本网站在此特别提醒您，在使用星若云云手机平台（以下称“本软件”）申请注册流程之前，您必须认真阅读、充分理解本协议各条款，特别是其中所涉及到免除或限制本网站责任的条款、排除或限制您权利的条款、授权条款、法律适用和争议条款等。如果您不同意协议任意或全部内容的，请不要以接受本软件服务的形式（包括但不限于点击同意/接受/下一步、进入购买程序、对星若云服务内容进行任何购买、采用任何其他形式的确认操作，下统称：接受服务的形式）进行下一步操作或使用本软件服务。如果您采用接受服务的形式进行下一步操作或使用本服务，即表明您已阅读、理解并同意签署本协议，自愿接受并遵守本协议的全部约定。
您知悉贵我双方共同签署的本协议列明的条款并不能完整罗列并覆盖您与星若公司之间的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。星若公司有权随时根据有关法律法规的变化、公司经营状况和经营策略调整和软件升级等原因修订本协议。变更后的协议条款将通过系统后台公告的形式发布，请您务必仔细阅读，当您采用接受服务的形式进行下一步操作或继续使用本服务，即表明您已经接受本协议的全部修改。更新后的本协议自更新版本发布之日起生效。
如果您是未满18周岁的未成年人，请在法定监护人陪同下阅读并确认本协议条款，并特别注意未成年人使用条款。

一、定义
    “本软件”指：由星若公司开发供您从下载平台下载，并在相应系统手持移动终端和电脑端中安装、使用的软件系统。
本软件是一款集游戏、工具、礼包及其他手机软件应用的云手机平台，包含多种第三方软件和服务应用，本软件不提供内容制作。

二、权利声明
    星若公司拥有本软件的版权，与本软件相关的所有信息内容均属于星若公司的知识产权，包括但不限于：本软件的文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等，星若公司享有知识产权，受到相关法律法规的保护。任何未经授权而擅自修改、发行、出租、翻译、分割、反向编译或反向工程本软件程序的全部或部分行为，均属于侵权行为，星若公司保留依法追究其法律责任的权利。
  1.本软件的名称、标识、UI、信息内容等包括以上标明的各种信息受法律保护，任何人不得复制、模仿；
  2.本软件受知识产权保护，任何第三方不得在未经官方同意下擅自修改、发行、出租、翻译、分割、反向编译或反向工程本软件；
  3.本软件内的软件、游戏、文字、图片等信息由其他用户上传，您可浏览、下载、存储、使用，但不得从事侵犯知识产权的活动；
  4.您在分享游戏、软件、链接地址时，应确认内容是合法的、不侵犯任何第三方知识产权的方可发布；
  5.您在浏览下载本软件中其他用户分享的信息时，发现有侵犯其他知识产权的言论，请及时通知星若公司。

三、授权范围
    星若公司授权您非商业性地使用本软件，并为您提供下载、安装、使用、升级、卸载和提供相关数据服务。您可以自主选择下载、安装或卸载以及使用本软件，可以使用星若公司提供的相应数据服务，享受星若公司的维护升级服务。您可以非商业性地复制和传播本软件。未经星若公司书面授权和许可，您不得进行商业性的销售、复制、传播以及其他商业活动。具体授权范围如下：
  1.您可以非商业性地下载、安装及使用本软件；
  2.您可以非商业性地复制、传播本软件，但必须保证每一份复制、传播的内容都是完整和真实的,包括所有有关本软件产品的软件、电子文档、版权和商标以及本协议。
  3.由于软件适配平台、操作系统及终端限制，本软件仅能在支持的系统平台及终端使用，请您在购买服务前仔细确认是否可在您使用的系统平台及终端使用本软件，若您点击购买服务进行支付后，则代表您已完全理解并确定本软件适用您所用的系统平台及终端。

四、软件使用授权
  1.软件使用须知：
   本软件是星若公司提供的一款旨在帮助您创建移动智能手机健康生态应用模式，提供虚拟手机软件应用和服务的云手机平台。在使用前您需认真了解以下内容：
   (1)本软件支持手机游戏等手机应用软件的远程控制功能，对于不同型号及操作系统的手机，本软件的使用方法也不相同。
   (2)使用本软件最佳前提保证手机电池电量高于20%，手机存储剩余空间大于10MB，以保证有足够电量及足够的空间完成获取过程。
   (3)使用本软件需注册软件账号，即成为注册用户后方可使用本软件，注册用户如果违反本平台相关协议约定，星若公司有权暂停或终止用户的账号使用权。
   (4)使用本软件在线查看接收到的文字、图片、文件等信息时，您手机会产生相应的数据流量费，由运营商收取。
   (5)本软件仅适用于其官方网站公布支持的操作系统，如果您在安装本软件后因任何原因欲放弃使用，可使用各操作系统提供的删除方式删除本软件。
   (6)您在本软件上使用第三方产品或应用时，不可使用影响本软件系统的正常运行的产品，如双开、多开、沙盒、框架等软件。
   (7)本软件中的授权功能仅用于您在云手机使用过程中发生异常情况，需要通过授权功能授权第三方帮您进行协同工作解决异常问题时使用授权功能，且由于授权第三方操作可能会导致您的隐私信息被第三方泄露，请您谨慎使用该功能；如果因为授权功能引发您与第三方之间的纠纷，星若云概不负责；同时星若云严禁用户使用授权功能进行云手机的线下交易行为。
   (8)若您有以下行为之一的，星若云将直接认定您的行为是以商业目的利用授权功能进行线下交易，星若云有权对您的账号进行暂时或永久限制部分或全部功能，您可通过申诉途径提交账号异常需要第三方协助的资料向星若云申请解封。
    a.以营利为目的，利用平台授权功能，在第三方电商及社交平台发布云手机出租或转让等信息。
    b.月周期内多次将其星若云账户下的部分或全部云手机通过授权功能授权给任意第三方用户使用。
  2.软件使用规则：
   您应在遵守法律及本协议的前提下使用本软件，在使用本软件时您不得违反以下规定：
   (1)您不得使用本软件制作、复制、发布、传播、储存包括但不限于下列内容的信息：
   反对宪法所确定的基本原则的；
   危害国家安全、泄露国家机密、国家统一的；
   损害国家荣誉和利益的；
   煽动民族仇恨、民族歧视，破坏民族团结的；
   破坏国家宗教政策、宣扬邪教和封建迷信的；
   散布谣言、扰乱社会秩序、破坏社会稳定的；
   观看、参与或散布淫秽、色情、暴力、赌博、恐怖或教唆犯罪的；
   侮辱或者诽谤他人，侵害他人合法权利的；
   任何侵犯任何第三方作品的知识产权的；
   侵害第三方姓名权、名誉权、肖像权、隐私权等各类合法权益的；
   含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感内容的；
   含有中国法律、法规、规章、条例以及任何具有法律效力的规范所限制或禁止的其它内容的；
   (2)不得运用本软件进行包括但不限于以下范围的行为：
   故意避开或者破坏著作者、开发者为保护本软件著作权而采取的技术措施；
   利用本软件误导、欺骗他人；
   违反国家规定，对本软件系统功能进行删除、修改、增加、干扰，造成本软件不能正常运行；
   破坏本软件系统的正常运行，故意传播计算机病毒等破坏性程序；
   其他任何危害计算机信息网络安全的；
   3.账号责任
   （1）您对本软件的账号负责，该账号仅您本人可以使用，未经星若星若云云手机书面同意并作账号实名变更，该账号不可以营利为目的许可第三方使用、不可转让、不可赠与、不可继承，否则星若云云手机有收回或暂时/永久封禁该账号的权利；
   （2）您对密码及账户的机密性承担全部责任，并对账户中发生的所有活动承担全部责任，因密码泄露或用户名遗忘所致的损失，由您自行承担。若您发现他人冒用或盗用其账号及密码或其他未经合法授权的使用或任何其他不安全的行为，您应立即以有效方式通知星若云云手机，要求星若云云手机暂停相关服务。同时，您理解星若云云手机对您的请求采取行动需要合理期限，在此之前，星若云云手机对已执行的指令及所导致您的损失不承担任何责任；
   （3）您理解并同意，星若云云手机有权了解您使用本软件服务的真实背景及目的，有权要求您如实提供真实、全面、准确的信息，如果星若云云手机有合理理由怀疑您提供的信息不真实、进行无授权线下交易、虚假交易，或您的行为违反星若云云手机的服务规则的，星若云云手机有权暂时或永久限制您账户下所使用服务的部分或全部功能。
   4.对于从非星若公司指定站点或非星若公司自主发行的渠道下载的本软件产品，星若公司无法保证该软件是否感染计算机病毒、是否隐藏有伪装的木马程序或者黑客软件，使用此类软件，将可能导致不可预损失测的风险，建议您不要轻易下载、安装、使用，如若发生以上情况，星若公司不承担任何由此产生的损失和赔偿。
   5.本软件不含有任何旨在破坏您移动通讯设备数据和获取您隐私信息的恶意代码，不含有任何跟踪、监视您的功能代码。
   6.如若您未遵守本软件使用规则，星若云有权采取相应措施，包括但不限于对本软件帐号和云手机的冻结、封停、终止部分或全部本服务以及删除相关信息。基于上述行为而被星若云冻结、终止、删除等其他限制措施的，星若云无需向您退还任何费用，未使用的服务费用作为违约金归归星若云所有，您账号内的损失由您自行承担，造成星若云损失的（包括但不限于律师费、诉讼费等），您也应予赔偿。
   7.如用户的违约行为使星若云遭受损失，包括星若云自身的直接经济损失、商誉损失及律师费、诉讼费等间接经济损失，用户应当赔偿星若云及上述全部损失。
   8.你的违约行为导致任何第三方损害的，您应当独立独立承担责任。如因任何原因导致星若云先行向第三方赔偿，你应在收到星若云的通知后立即将赔偿金支付给星若云。
  
五、第三方软件或服务
   本软件可能使用或包含了由第三方提供的软件或服务（以下称“此类服务”），此类服务是响应您需求，为了向您提供更多便利而设置，星若公司不提供内容制作。您使用此类服务时，应另行与该第三方达成服务协议，支付相应费用并承担可能的风险。您如果继续使用本软件或服务，则表示您默认以下几点：
   1.星若云无权在本协议中授予您使用第三方软件或服务的任何权利，也无权对此类服务提供任何形式的保证以及相应的客户服务支持，如果您需要咨询相关信息，可直接与该第三方联系。如果您因使用此类服务引发任何纠纷或造成任务损失，可直接与该第三方协商解决，星若云不承担任何责任和赔偿。
   2.您现使用的本软件服务及本软件当前包含的服务，星若云在此不保证您可永久使用本服务或本软件包含的服务永久不变，不保证将来不会使用除现有以外的其他同类或不同类型的软件或服务，一旦本软件中更改/增加服务内容或升级为包含前述服务内容的软件，其同样适用本协议规定。
   3.如果第三方确认您违反了您与其之间关于使用此类服务的协议约定，并停止对您提供此类服务，同时要求星若云协助处理的，您理解并认可星若云将采取技术手段中止或终止您对该第三方软件的继续使用。
   
六、隐私权保护
   您同意个人隐私信息是指那些能够对您进行个人辨识或涉及个人通信的信息，包括下列信息：您真实姓名，身份证号，手机号码，IP地址。本软件仅提供云手机服务，本软件不会主动采集您在云手机内使用第三方软件、游戏的账号、个人信息，但是由于您所使用的其他第三方软件、游戏等会自动在云手机硬件存储保存账号密码以及个人隐私信息，我们在您的云手机服务到期以后，系统将自动对您使用过的云手机进行信息清理，充分保障您的个人数据和隐私信息不会被用作其他用途。
   尊重您个人隐私信息的私有性是星若公司的一贯制度，星若公司将会采取合理的措施保护您的个人隐私信息，除法律或有法律赋予权限的政府部门要求或您同意等原因外，星若公司未经您同意不向除合作单位以外的第三方公开、 透露您个人隐私信息。 但是，您在注册时选择同意，或您与星若云及其他合作单位之间就您个人隐私信息公开或使用另有约定的除外，同时您应自行承担因此可能产生的任何风险，星若云对此不予负责。

七、协议终止和违约责任
   您应当在软件授权范围内使用本软件、尊重本软件及其所包含的知识产权、使用规范等相关内容；按本协议约定履行义务是您使用本软件的前提。
   您如果违反本软件及其他相关使用要求、条款、协议、通告等内容，而被终止提供服务，星若云无需向您退还任何费用，未使用的服务费用作为违约金归归星若云所有，您账号内的损失由您自行承担，造成星若云损失的（包括但不限于律师费、诉讼费等），您也应予赔偿。
   您如果出于维护平台秩序及保护消费者权益的目的，向星若云作出任何形式的承诺，在星若云确认您违反了该承诺的前提下，星若云可按您的承诺或协议约定的方式对您的使用本软件的权益采取限制措施，包括中止或终止本协议。
   如果您违反本协议或与星若云签订的其他协议约定，星若云可对您在其中获得的权益采取限制措施，包括中止、终止对您提供部分或全部服务，且在星若云官方平台依法公示您的违约情况。
   本软件由您在各类下载平台自主下载获得，您需遵守相应下载平台对您使用本软件的相关约定，如果上述第三方平台确认您违反该约定需要星若云协助处理的情况，星若云可能会因第三方要求终止您使用本软件或服务。
   在本协议终止时，您应停止对本软件的使用行为, 并删除本软件的全部副本。
   如您违反本协议规定的条款，给星若云及或其他用户造成损失，您必须承担全部的赔偿责任。如我们承担了上述责任，则您同意赔偿我们的相关支出和损失。
   责任免除，您同意，在法律允许的范围内，下属情况不属于星若云云手机违约，星若云云手机不承担任何责任：
   
   1.您由于下属原因无法正常使用产品服务的情况：
   （1）您遭到黑客攻击，导致数据丢失，服务中断；
   （2）您由于第三方软件自身的系统、网络配置变更导致数据丢失，服务中断；
   （3）您由于第三方软件自身的程序bug导致服务不可正常使用；
   （4）其他由于非星若云原因导致的服务异常情况。
   2.星若云云手机在进行服务器配置、维护时，需要短时间中断服务，且已提前通知您的；
   3.非星若云云手机原因导致的Internet上的通路堵塞，造成您网络访问速度下降等服务异常或中断，包括但不限于：
   （1）地震、爆炸、洪水、火灾、暴风雨、台风等天灾；
   （2）战争、类似战争行为、敌对行为、武装冲突、恐怖活动、谋反、政变等情况；
   （3）罢工、暴动、民众骚乱或恶意行为；
   （4）电力或动力故障、公用设施或其他电信故障；
   （5）政府行为、政策变化、封锁、禁运、电信部门技术调整、政府管制等。
   4.其他免责情形
   
八、法律及争议解决
   本协议的各项条款均适用中华人民共和国法律的相关规定。如无相关法律规定，则可参照行业惯例。
   星若云可能根据业务调整而变更向您提供的软件或服务的主体，变更后，星若云与您共同履行本协议，以上变更不会影响您在本协议下的权益。发生争议时，您可根据具体使用的服务及对其权益产生影响的具体行为对象确定与您履约的主体及争议相对方。
   因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；如若协商不成，任何一方均可将有关争议提交至软件服务提供方所在人民法院解决。
   
九、信息变更
   您如变更账户信息、通讯地址、电话等相关重要信息，须及时通知星若公司。因您未及时通知而导致自身受到的一切损失，由您自行承担责任。
   
十、赔偿
   1、您因违反本协议或本协议项下的其他文件，或违反了任何法律、法规的规定，给星若公司造成损失的，应予赔偿，赔偿范围包括但不限于星若公司的直接损失、间接损失以及维权费用（律师费、诉讼费、保全费、鉴定费、诉讼费）等。
   2、您因违反前款规定而侵害了第三方的权利，导致星若公司遭受任何第三方提起的索赔、诉讼或行政责任，您承诺无条件承担相应责任并使本网站免责。若因此给星若云造成损失的，应予赔偿，赔偿范围包括但不限于本网站的维权费用（律师费、诉讼费、保全费、鉴定费、诉讼费）、名誉损失以及星若公司向第三方支付的补偿金等。
   3、本软件的云手机依托于硬件，受限于技术条件以及硬件损耗，请您理解：我们不会保存您在云手机内使用的第三方软件、游戏的账号数据和个人隐私信息。当硬件出现不可挽回的损伤的情况下，我们将会主动进行硬件维护和硬件升级，为了更加有效保护您的个人信息数据安全，此时您的第三方软件、游戏的账号和个人信息将会被清理，请您妥善保管好相关信息，我们不对数据的清理承担任何因储存或丢失而产生的法律责任。
   4、您在购买服务后即认同星若云云手机按现状提供服务，若您中途主动取消或终止服务的，将不会获得星若云云手机服务费用的退还。您理解，星若云云手机无法保证所提供的产品服务毫无瑕疵，并同意即使星若云云手机提供的服务存在卡顿等瑕疵，也不被视为违约，您同意和星若云云手机一同合作解决服务瑕疵问题。
  
十一、其他条款
  如果本协议中的任何条款无论因何种原因完全或部分无效，或不具备可执行力，均不影响其它条款的效力。 
  您在使用本软件时，仔细阅读并遵守本许可协议和免责声明。
  星若公司在法律允许的最大范围内对本协议拥有解释权与修改权。
  
  福州星若网络科技有限公司    2021年8月14日
</pre>`
let privacypoli = 
`
<pre class="agreement-p">
   星若云手机是指包括福州星月网络科技有限公司及其关联公司在内的企业集团。 关联公司是指在现在、将来控制福州星月网络科技有限公司、受福州星月网络科技有限公司控制或与上海畅指网络科技有限公司处于共同控制下的公司、机构。控制指通过所有权、有投票权的股份、合同、实际运营关联或其他被依法认定的方式直接或间接地拥有影响被控制对象管理/经营的能力。 我们的主要运营公司基本情况如下：

 一、本《星若云手机隐私政策》适用范围、相关词语涵义
  （一）本《星若云手机隐私政策》适用范围
   本《星若云手机隐私政策》为我们的所有产品与/或服务统一适用的通用内容，当您使用我们的任何产品与/或服务时，本《星若云手机隐私政策》即适用，但如该产品与/或服务单独设置了隐私条款/隐私协议的，单独的隐私条款/隐私协议优先适用；单独的隐私条款/隐私协议未提及的内容，适用本政策。但请您注意，本《星若云手机隐私政策》不适用于以下情况：
   为我们的产品与/或服务提供广告服务的第三方的信息收集/处理做法 我们的产品与/或服务可能会包含或链接至第三方提供的信息与/或第三方服务（包括任何第三方应用、网站、产品、服务等），这些信息与/或服务由第三方负责运营，您使用该等信息与/或服务与我们无关。我们在此善意的提醒您，您在使用第三方信息与/或服务时，应留意和仔细阅读第三方向您展示的相关用户协议和隐私政策，并妥善保管和谨慎提供您的个人信息。本《星若云手机隐私政策》仅适用于我们所收集的您的个人信息，并不适用于任何第三方对您的个人信息的收集，以及任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方收集、储存和使用的您个人信息的行为在法律允许的范围内亦不承担任何责任； 其他非星若云手机向您提供的产品与/或服务内容。
  （二）相关词语涵义
   我们的产品与/或服务：包括但不限于我们提供的软件、网站、服务（含站外服务，例如：我们的广告服务和“通过我们的服务申请或分享”的插件等）以及包含的相关产品或服务功能。 我们需要特别提醒您的是：由于我们的产品和服务较多，为您提供的产品和服务内容也有所不同，本《星若云手机隐私政策》为星若云手机统一适用的一般性隐私条款，本政策约定的用户权利和我们提供的相关信息安全保护措施均适用于我们的所有产品和服务；本政策所述之“我们的产品与/或服务”以及我们收集的您个人信息的类型和对应的使用、处理规则等可能会因您使用的具体的产品/服务（包括客户端类型、软件版本等）而有所不同，具体以您实际使用的产品/服务的实际情况为准。针对我们的某些特定产品/服务，我们还将制定特定隐私条款或隐私协议，以便更具体地向您阐明我们的隐私规则和保护措施等内容。
   个人信息（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括个人基本资料（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱）、个人身份信息（包括身份证信息）、个人生物识别信息（包括指纹、面部特征）、网络身份标识信息（包括系统账号、IP地址、邮箱地址以及与前述有关的密码、口令、口令保护答案、用户个人数字证书）、个人财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额）、交易和消费记录、流水记录、虚拟货币（如雷币、优惠券等）、虚拟交易、兑换码等虚拟财产信息））、通讯录信息、个人上网记录（包括网站浏览记录、软件使用记录、点击记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）、个人位置信息（包括大概地理位置、精准定位信息）。我们实际具体收集的个人信息种类以下文描述为准。
   个人敏感信息（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中涉及的个人敏感信息包括您的财产信息（包括银行账号、鉴别信息（口令）、资金信息（包括资金数量、收益、余额）、交易和消费记录、流水记录、虚拟货币（雷币、优惠券等）、虚拟交易、兑换码等虚拟财产信息））、个人生物识别信息（包括指纹、面部特征）、个人身份信息（包括身份证信息）、网络身份识别信息（包括系统账号、邮箱地址以及与前述有关的密码、口令、口令保护答案、用户个人数字证书）、其他信息（包括通讯录信息、个人电话号码、精准定位信息、收货地址、网页浏览记录）、儿童个人信息。您同意您的个人敏感信息按本《星若云手机隐私政策》所述的目的和方式来处理。我们实际具体收集的个人敏感信息种类以下文描述为准。相比其他个人信息，个人敏感信息可能对您的个人权益影响更大。我们在此善意的提醒您需在谨慎考虑后再向我们提供您的个人敏感信息。 儿童：指不满十四周岁的未成年人。（出自于《儿童个人信息网络保护规定》） 匿名化：指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》） 去标识化：指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》） 删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。（出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》）

二、我们如何收集和使用您的个人信息
   您在使用我们的产品与/或服务时，我们需要/可能需要收集和使用您的一些个人信息，我们收集和使用的您的个人信息类型包括两种：第一种：我们产品与/或服务的核心业务功能所必需的信息：此类信息为产品与/或服务正常运行的必备信息，您须授权我们收集。如您拒绝提供，您将无法正常使用我们的产品与/或服务；第二种：我们产品与/或服务的附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。 我们需要特别提醒您的是：由于我们的产品和服务较多，为您提供的内容也不同，因此核心业务功能（包括其收集的您的个人信息类型）也会因产品/服务的内容不同而有所区别，具体以产品/服务实际提供为准。除此之外，您理解并同意，我们希望提供给您的产品和服务是完善的，所以我们会不断改进我们的产品和服务，包括技术，这意味着我们可能会经常推出新的业务功能，可能需要收集新的个人信息或变更个人信息使用目的或方式。如果某一需要收集您的个人信息的功能或产品/服务未能在本《星若云手机隐私政策》中予以说明的，我们会通过更新本政策、页面提示、弹窗、网站公告等方式另行向您说明该信息收集的目的、内容、使用方式和范围，并为您提供自主选择同意的方式，且在征得您明示同意后收集。在此过程中，如果您对相关事宜有任何疑惑的，可以通过文末提供的方式联系我们，我们会尽快为您作出解答。
   具体业务功能场景包括：
   搜索功能
   当您使用搜索功能时，我们需要收集您的一些信息，包括如下个人信息：搜索的字词（包括语音信息）、浏览记录和时间、搜索的时间以及与它们互动的次数。我们收集这些信息是为了向您提供您所需要的内容和可能更感兴趣的服务，同时亦可以改进我们的产品和服务。
   账号注册功能
   当您使用账号注册功能时，您需要按照我们的指引完成一系列注册程序，在您成为注册用户后，我们将为您提供专属于注册用户的产品与/或服务。在此过程中，您需要提供给我们一些单独或者结合识别您的用户身份的信息，包括：手机号码、验证码匹配结果，并创建密码。我们收集这些信息是用以完成注册程序、为您持续稳定提供服务，并保护您的账号安全。您应知悉，手机号码和验证码匹配结果属于您的个人敏感信息，我们收集该类信息是为了满足相关法律法规的要求，如您拒绝提供可能导致您无法使用我们的此功能，请您谨慎考虑后再提供。同时，您也可以在注册时或后续使用过程中填写或补充您的性别、昵称、头像，如您未填写或后续删除、变更此类信息的，可能会影响（包括无法获取到）我们为您提供的基于您的个人画像信息的影视作品推荐、您感兴趣的广告呈现等，但不会影响注册及会员功能的正常使用。 需要说明的是，我们的一些平台支持您使用第三方平台的账号（例如：微信/QQ）进行登录，如您使用第三方平台的账号登录的，我们将根据您的授权获取该第三方账号下的相关信息（包括：昵称、头像，具体以您的授权内容为准）以及身份验证信息（个人敏感信息）。 我们收集这些信息是用于为您提供账号登录服务以及保障您的账号安全，防范安全风险。如您拒绝授权此类信息的，您将无法使用第三方平台的账号登录我们平台，但不影响我们为您提供的其他产品和服务的正常使用。您知悉并同意，对于您在使用产品与/或服务的过程中提供的您的一种或多种联系方式（例如：电子邮箱、联系电话、传真号码、联系地址），我们在运营中可能会向其中的一种或多种发送多类通知，用于用户消息告知、身份验证、安全验证等用途；此外，我们也可能会将在前述过程中收集的手机号码、电子邮箱通过短信、电话、邮件的方式用作向您提供您可能感兴趣的广告、商业活动等商业性信息的用途，但请您放心，如您不愿接受该商业性信息，您可以通过手机短信、电子邮件中提供的退订方式进行退订。
   基于设备相册权限的附加业务功能
   当您使用评论、反馈等业务功能时，我们将需要获取您的设备相册权限，并收集您提供的图文及视频内容信息（个人信息）。如您拒绝提供的仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。相册权限是您设备上的一项设置，您可以通过设备设置页面进行管理。
   基于设备相机权限的附加业务功能
   当您使用问题反馈等业务功能时，我们将需要获取您的设备相机权限，并收集您提供的图片、视频信息（个人信息）。如您拒绝提供的仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。相机权限是您设备上的一项设置，您可以通过设备设置页面进行管理。
   基于设备麦克风权限的附加业务功能 当您使用语音等业务功能时，我们将需要获取您的设备麦克风权限，并收集您的语音信息、语音交互信息（个人信息）。如您拒绝提供的仅会使您无法使用该功能，但并不影响您正常使用产品与/或服务的其他功能。麦克风权限是您设备上的一项设置，您可以通过设备设置页面进行管理。
   身份认证功能
   当您使用我们的产品与/或服务中的身份认证功能或服务时，为满足相关法律规定及监管要求、确保用户身份真实性、实现反欺诈等风险控制、保障系统和服务安全或提供服务之需要，我们将需要收集您的真实身份信息（可能包括姓名、身份证相关信息、面部特征信息（静态或动态）、手机号码）（个人敏感信息）以完成实名认证，相关业务场景可能包括：注册产品时、使用信息发布等服务时、申请使用“雷电账号”服务时、网络游戏用户实名注册和交易时、您同意我们可以自行或委托第三方向有关机构（如个人征信机构、政府机构等）提供、查询、核对您的前述身份信息。在您实名认证成功后，如无正当事由，实名信息将无法修改，如确需修改，请您与我们联系解决。
   同时，为协助您快速完成实名认证、风控核验等，对于您曾经在我们的产品与/或服务中提供的相关实名认证信息（包括姓名、身份证相关信息、手机号码）（个人敏感信息），您同意我们可以将前述信息的全部或部分自动预填于其他需要您实名认证的页面，您知悉并认可，我们仅协助填写，并未直接传输，只有在您点击下一步操作后才由您自行提供至对应服务系统。
   客服、其他用户响应功能
   当您联系我们的客服或使用其他用户响应功能时（包括：提出我们的产品与/或服务的售后申请、行使您的相关个人信息控制权、其他客户投诉和需求），为了您的账号与系统安全，我们可能需要您先行提供账号信息，并与您之前的个人信息相匹配以验证您的用户身份。在您使用客服或其他用户响应功能时，我们可能还会需要收集您的如下个人敏感信息：联系方式（您与我们联系时使用的电话号码/电子邮箱或您向我们主动提供的其他联系方式）、您与我们的沟通信息（包括文字/图片/音视频/通话记录形式）、与您需求相关联的其他必要信息。我们收集这些信息是为了调查事实与帮助您解决问题，如您拒绝提供可能导致您无法使用我们的客服等用户响应机制。
   保障账号安全功
   我们需要收集您的一些信息来保障您使用我们的产品与/或服务时的账号与系统安全，并协助提升我们的产品与/服务的安全性和可靠性，以防产生任何危害用户、星若云手机、社会的行为，包括：您的如下个人信息：账号登录地、个人常用设备信息、登录IP地址、产品版本号、语言模式、浏览记录、网络使用习惯、服务故障信息，以及个人敏感信息：交易信息、会员实名认证信息。我们会根据上述信息来综合判断您账号、账户及交易风险、进行身份验证、客户服务、检测及防范安全事件、诈骗监测、存档和备份用途，并依法采取必要的记录、审计、分析、处置措施，一旦我们检测出存在或疑似存在账号安全风险时，我们会使用相关信息进行安全验证与风险排除，确保我们向您提供的产品和服务的安全性，以用来保障您的权益不受侵害。同时，当发生账号或系统安全问题时，我们会收集这些信息来优化我们的产品和服务。 从外部第三方间接收集的您的个人信息 您知悉，您向外部第三方（星若云手机旗下公司不在此限）提供的个人信息，或外部第三方收集的您的个人信息，我们无法获取，更不会使用非常规方式（如：恶意干预对方系列APP数据）擅自以软件程序获得您的个人信息。如果因业务发展的必要而需要从第三方间接收集（如共享等）您的个人信息的，且由我们直接或联合为您提供产品或服务的，我们（或第三方）在收集前会向您明示共享的您个人信息的来源、类型、使用目的、方式和所用于的业务功能、授权同意范围（如果使用方式和范围超出您在第三方原授权范围的，我们会再次征得您的授权同意），此种场景包括您通过第三方账户直接登录我们的产品与/或服务时，我们从第三方获取的您授权共享的账户信息（包括头像、昵称）、我们的某些产品/服务由业务合作伙伴提供或者我们与业务合作伙伴共同提供时，为了必要/合理的业务的顺利开展，我们从部分业务合作伙伴处间接收集的您的部分信息、其他方使用我们的产品与/或服务时所提供有关您的信息（包括发布的与您相关的内容，包括评论、动态、图片、照片、视频）。 此外，我们会在间接收集您的个人信息前，明确以书面形式（如协议、承诺书）要求该第三方在已经取得您明示同意后收集个人信息，并向您告知共享的信息内容，且涉及敏感信息的在提供给我们使用前需经过您的再次确认，在协议等层面要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求对方承担相应法律责任；同时，我们的专业安全团队对个人信息进行安全加固（包括敏感信息报备、敏感信息加密存储、访问权限控制等）。我们会使用不低于我们对自身用户个人信息同等的保护手段与措施对间接获取的个人信息进行保护。
   个性化推荐/定向推送、维护/改进我们的产品/或服务之必需
   为了向您提供更优质和更适合您的产品与服务、让您有更好的产品与服务的使用体验或您同意的其他用途，在符合相关法律法规的前提下，我们可能会收集您在我们的某一项产品与/或服务中的相关个人信息，例如：搜索记录、收藏记录、订单信息、IP地址、访问日期和时间、您的偏向网络行为、兴趣偏好、设备相关信息（例如硬件型号、设备MAC地址、IMEI、IMSI、必要的软件列表），并以综合统计、分析的方式单独或与来自其他服务的某些信息结合进行使用以形成用户画像，以帮助我们更加了解您如何使用我们的产品与/或服务、维护和改进我们的产品与/或服务或向您提供个性化服务/定向推送，包括我们向您提供相关个性化信息、在征得您同意的情况下与我们的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。
   定向推送消息服务我们以接入的第三方SDK——友盟SDK为用户提供服务：
   使用SDK名称：友盟SDK
   服务类型：通知推送服务，设备运行错误日志信息统计
   收集个人信息类型：设备信息（IMEI/MAC/Android ID/IDFA/OpenUDID/GUID/SIM卡IMSI/地理位置）
   友盟隐私权政策链接：https://www.umeng.com/page/policy
   同时，我们可能会收集您使用我们的产品与/或服务时的其他信息做一些其他合理用途，包括：调查问卷回复、您与星若云手机旗下公司/我们的合作伙伴之间互动时我们获得的相关信息用于研发和改进、综合统计、数据分析或加工等处理、经您同意或授权的其他用途、遵守法律规定或其他一些合理用途，例如：您在特定营销活动中获得的红包，法律要求我们履行代扣代缴个人所得税的义务，因此我们需要依法收集您的姓名、身份证信息（个人敏感信息）。如我们在相关产品与/或服务之中提供了相应选项，您也可以主动要求我们将您在该产品与/或服务所提供和储存的个人信息用于我们或我们合作方的其他服务。 其他 如上文所述，如果某一需要收集您的个人信息的功能或产品/服务未能在本《星若云手机隐私政策》中予以说明的，或者我们超出了与收集您的个人信息时所声称的目的及具有直接或合理关联范围的，我们将在收集和使用你的个人信息前，通过更新本《星若云手机隐私政策》、页面提示、弹窗、消息通知、网站公告或其他便于您获知的方式另行向您说明，并为您提供自主选择同意的方式，且在征得您明示同意后收集和使用。
   例外情形
   另外，您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需您的授权同意：
   与国家安全、国防安全有关的；
   与公共安全、公共卫生、重大公共利益有关的；
   与犯罪侦查、起诉、审判和判决执行等直接相关的；
   出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
   所收集的信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；
   根据与您签订和履行相关协议或其他书面文件所必需的；
   用于维护我们的产品与/或服务的安全稳定运行所必需的，例如：发现、处置产品与/或服务的故障； 有权机关的要求、法律法规等规定的其他情形。
   
三、我们如何使用Cookie和同类技术
  （一）关于Cookie和同类技术
   Cookie是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie同类技术是可用于与Cookie类似用途的其他技术，例如：Web Beacon、Proxy、嵌入式脚本等。 目前，我们主要使用Cookie收集您的个人信息。您知悉并同意，随着技术的发展和我们产品和服务的进一步完善，我们也可能会使用Cookie同类技术。
  （二）我们如何使用Cookie和同类技术
   在您使用我们的产品与/或服务时，我们可能会使用Cookie和同类技术收集您的一些个人信息，包括：您访问网站的习惯、您的浏览信息、您的登录信息，Cookie和同类技术收集该类信息是为了您使用我们的产品与/或服务的必要、简化您重复操作的步骤（如注册、登录）、便于您查看使用历史（如视频观看历史）、向您提供更切合您个人需要的服务内容和您可能更感兴趣的内容、保护您的信息和账号安全性、改善我们的产品和服务等。我们承诺仅在本《星若云手机隐私政策》所述目的范围内使用Cookie和同类技术。 如果您的浏览器允许，您可以通过您的浏览器的设置以管理、（部分/全部）拒绝Cookie与/或同类技术；或删除已经储存在您的计算机、移动设备或其他装置内的Cookie与/或同类技术，从而实现我们无法全部或部分追踪您的个人信息。您如需详细了解如何更改浏览器设置，请具体查看您使用的浏览器的相关设置页面。您理解并知悉：我们的某些产品/服务只能通过使用Cookie或同类技术才可得到实现，如您拒绝使用或删除的，您可能将无法正常使用我们的相关产品与/或服务或无法通过我们的产品与/或服务获得最佳的服务体验，同时也可能会对您的信息保护和账号安全性造成一定的影响。

四、我们如何共享、转让、公开披露您的个人信息
  （一）共享
   我们会重视对您的个人信息的保护，您的个人信息是我们为您提供产品与/或服务的重要依据和组成部分，对于您的个人信息，我们仅在本《星若云手机隐私政策》所述目的和范围内或根据法律法规的要求收集和使用，并严格保密，我们不会与星若云手机以外的第三方公司、组织和个人共享您的个人信息，除非存在以下一种或多种情形： 您自行提出要求的； 事先已征得您的明确授权同意； 星若云手机内部的必要、合理共享；包括：
   （1）为便于我们基于星若云手机统一的账号体系向您提供一致化服务、向您推荐您可能更感兴趣的内容、保障和提升我们的服务与系统的安全性和可靠性、保护星若云手机或用户或公众的人身财产安全免遭侵害以及便于您进行统一管理，您知悉并同意，您的相关个人信息可能会在星若云手机产品内部进行必要共享，但请您放心，我们只会在必要和合理范围内共享信息且仅在前述目的范围内进行处理，如果我们需要共享您的个人敏感信息或关联公司需要改变个人信息的使用及处理目的时，我们会将再次征求您的授权同意； 与部分业务合作伙伴的必要共享； 
   您理解并同意，为了必要/合理的业务的顺利开展、满足您的要求、履行我们在相关用户协议或本隐私政策中的义务和行使我们的权利或遵守法律规定等目的，我们可能需要向部分业务合作伙伴共享您的部分信息。但我们承诺我们只会共享您的必要个人信息，如果我们共享您的个人敏感信息或改变个人信息的使用及处理目的，我们会将再次征求您的授权同意。我们的业务合作伙伴包括：
   （1）为我们的产品与/或服务提供功能支持的服务提供商：包括：提供支付服务的支付机构、提供一键登录服务的运营商、第三方配送公司和其他服务提供商，我们共享信息的目的是可以实现我们产品与/或服务的功能，让您可以正常使用；
   （2）我们平台的第三方商家：为实现您购买产品或服务的需求（包括享受售后服务），我们会将您的订单信息与交易相关的信息共享给我们平台的第三方商家；
   （3）提供数据服务（包括网络广告监测、数据统计、数据分析）的合作伙伴：为维护/改进我们的产品/服务、为您提供更好的内容，我们可能会与提供该服务的指定合作伙伴共享您的相关信息，为了您的信息安全，我们目前仅与已签署严格数据安全保密协议的合作伙伴进行合作，包括：索瑞福、艾瑞咨询集团等，且这些公司必须遵守我们的数据隐私和安全要求。除非得到您的同意，我们不会与其共享您的个人身份信息；
   （4）第三方SDK类服务商：我们产品中可能会包含第三方SDK或其他类似的应用程序，如您在我们平台上使用这类由第三方提供的服务时，您同意将由其直接收集和处理您的信息（如以嵌入代码、插件等形式），例如：如您使用华为手机的，华为Push SDK需要读取您的IMEI信息，用于推送/下发通知栏消息；当您使用小米账号登录我们的产品时，小米SDK需要收集您的小米账号信息；如您使用支付宝付款的，为了让您能够在交易安全的环境中完成交易、实现交易目的，支付宝SDK需要读取您的IMEI信息。前述服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。但我们也会努力审查该第三方的业务准入资质并努力要求该等服务商的合法合规性与安全性。为了最大程度保障您的信息安全，我们强烈建议您在使用任何第三方SDK类服务前先行查看其隐私条款。为保障您的合法权益，如您发现这等SDK或其他类似的应用程序存在风险时，建议您立即终止相关操作并及时与我们取得联系；
   （5）委托我们进行信息推广和广告投放的合作伙伴：您授权我们有权与委托我们进行信息推广和广告投放的合作伙伴共享我们使用您的相关信息集合形成的间接用户画像、去标识化或匿名化处理后的分析/统计类信息，以帮助其进行广告或决策建议、提高广告有效触达率、进一步了解用户需求。当前述合作伙伴为向您提供借贷、存款等服务的金融机构（包括银行、借贷、保险、基金证券公司等机构）时，我们会另行取得您的授权，并在您授权后将您的相关信息（包括：姓名、身份证信息、通讯录信息，具体以您的授权内容为准）同步给该合作伙伴，以便协助您快速完成身份验证、输入紧急联系人信息、风控核验等；同时，您授权我们可以与前述金融机构共享我们使用您的相关信息集合形成的间接用户画像、去标识化或匿名化处理后的分析/统计类信息，以帮助其判断您的资信状况、降低坏账率、保障商业安全和防欺诈等。我们承诺：未经您的同意，我们不会与其共享可以识别您身份的个人信息；
   （6）与我们共同提供某项服务的合作伙伴，例如：我们与合作伙伴共同开展营销活动，为了能够向您提供正常服务和满足您的服务需求，我们会另行取得您的授权，并在您授权后将您的相关信息（具体以您的授权内容为准）同步给该合作伙伴。 共享的是去标识化的信息，且接受该信息共享的第三方无法重新识别信息主体身份； 为了保护您、我们的其他用户或员工、星若云手机或社会公共利益、财产或安全（例如：欺诈或信用风险等）免遭损害而与第三方的共享； 某些情况下，只有共享您的个人信息，才能实现我们的产品与/或服务的核心功能或提供您需要的服务，或处理您与他人的纠纷或争议； 依据您与我们签署的相关协议（例如：在线协议、平台规则等）或法律文件而共享的； 符合您与其他第三人之间的有关约定的； 基于合理商业习惯而共享的，例如：与第三方共享联合营销活动中的中奖/获胜者等信息，以便其能及时向您发放奖品/礼品等；我们接受尽调时等； 基于学术研究而使用，例如：以学术研究为目的而与学术机构共享我们使用您的相关信息集合形成的间接用户画像、去标识化或匿名化处理后的分析/统计类信息（未经您的同意，我们不会与其共享可以识别您身份的个人信息）；学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行匿名化处理的； 有权机关的要求、诉讼争议需要、法律法规等规定的其他需要共享的情形。 您可以基于星若云手机的平台与第三人（包括不特定对象）共享您的个人信息或其他信息，但因您的共享行为而导致的信息泄露、被使用等情况，与星若云手机无关，您需要自行承担相应的法律责任。 我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享必要的个人信息。在我们与业务合作伙伴共享信息时，我们会以多种方式保护您的个人信息，包括但不限于：（1）如具备上述合理事由且需要您授权同意的，我们会在共享前向您告知共享的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容）并在取得您授权同意后再共享；（2）在合作协议层面，我们会严格要求合作伙伴的信息保护义务与责任，为此，我们的法律部门要求业务合作伙伴在合作前需与星若云手机签署关于数据安全的保护协议，协议严格约定了业务合作伙伴的用户信息保密义务，包括信息的保管、使用和流转等均应满足我们的管控要求，接受我们的审核、监督等，一旦有任何违反，将须承担相应法律责任；（3）此外，我们的安全团队将对信息数据的输出形式、流转、使用等做安全评估与处理等。请您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并尽量对共享内容中的个人信息进行匿名化处理。您理解并知悉，匿名化处理后的信息无法指向与识别您，已不属于法律意义上的个人信息，其处理、使用、共享、转让无需征得您的授权同意。
  （二）转让
   转让是指将个人信息控制权向其他公司、组织或个人转移的过程。原则上我们不会将您的个人信息转让，但以下情况除外：
   您自行提出要求的；
   事先已征得您的明确授权同意；
   如我们进行兼并、收购、重组、分立、破产、资产转让或类似的交易，而您的个人信息有可能作为此类交易的一部分而被转移，我们会要求新持有人继续遵守和履行该《星若云手机隐私政策》的全部内容（包括使用目的、使用规则、安全保护措施等），否则我们将要求其重新获取您的明示授权同意；
   法律法规等规定的其他情形。
   如具备上述事由确需转让的，我们会在转让前向您告知转让的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容），并在征得您的授权同意后再转让，但法律法规另有规定的或本政策另有约定的除外。
  （三）公开披露
   公开披露是指向社会或不特定人群发布信息的行为。除了因需要对违规账号、欺诈行为等进行处罚公告、公布中奖/获胜者等名单时脱敏展示相关信息等必要事宜而进行的必要披露外，我们不会对您的个人信息进行公开披露，如具备合理事由确需公开披露的，我们会在公开披露前向您告知公开披露的信息的目的、类型（如涉及您的个人敏感信息的，我们还会向您告知涉及的敏感信息的内容），并在征得您的授权同意后再公开披露，但法律法规另有规定的或本政策另有约定的除外。
   对于公开披露的您的个人信息，我们会充分重视风险，在收到公开披露申请后第一时间且审慎审查其正当性、合理性、合法性，并在公开披露时和公开披露后采取不低于本《星若云手机隐私政策》约定的个人信息安全保护措施和手段的程度对其进行保护。
   请您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的公开披露您的个人信息，并尽量对公开披露内容中的个人信息进行匿名化处理。
   例外情形
   根据法律法规等规定，在下述情况下，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
   与国家安全、国防安全直接相关的；
   与公共安全、公共卫生、重大公共利益直接相关的；
   与犯罪侦查、起诉、审判和判决执行等直接相关的；或根据法律法规的要求、行政机关或公检法等有权机关的要求的；
   出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
   个人信息是您自行向社会公开的或者是从合法公开的渠道（如合法的新闻报道、政府信息公开等渠道）中收集到的；
   根据与您签订和履行相关协议或其他书面文件所必需的；
   法律法规等规定的其他情形。
  （四）共享、转让、公开披露的相关责任
   我们将严格按照本隐私政策的约定及相关法律法规的要求执行对个人信息的共享、转让、公开披露的操作，如因我们的过错原因导致您的合法权益遭受损害的，我们愿意就我们的过错在法律规定的范围内向您承担相应的损害赔偿责任。  

五、您对个人信息享有的控制权
   您对我们产品与/或服务中的您的个人信息享有多种方式的控制权，包括：您可以访问、更正/修改、删除您的个人信息，也可以撤回之前作出的对您个人信息的同意，同时您也可以注销您的星若云手机账号。为便于您行使您的上述控制权，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以自行进行操作，如您在操作过程中有疑惑或困难的可以通过文末的方式联系我们来进行控制，我们会及时为您处理。
  （一）访问权
   您可以在我们的产品与/或服务中查询或访问您的相关个人信息，包括：
   账号信息：您可以通过相关产品页面随时登录您的个人账号，以访问您的账号中的个人资料信息，包括：头像、昵称、生日、性别、个性签名等。
   使用信息：您可以通过相关产品页面随时查阅您的使用信息。
   其他信息：如您在此访问过程中遇到操作问题的或如需获取其他前述无法获知的个人信息内容，您可通过文末提供的方式联系我们，我们将在核实您的身份后在合理期限内向您提供，但法律法规另有规定的或本政策另有约定的除外。
  （二）更正/修改权
   您可以在我们的产品与/或服务中更正/修改您的相关个人信息。为便于您行使您的上述权利，我们为您提供了在线自行更正/修改和向我们提出更正/修改申请两种方式。
   对于您的部分个人信息，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以直接进行更正/修改。
   对于您在行使上述权利过程中遇到的困难，或其他可能未/无法向您提供在线自行更正/修改权限的， 经对您的身份进行验证，且更正不影响信息的客观性和准确性的情况下，您有权对错误或不完整的信息作出更正或修改，或在特定情况下，尤其是数据错误时，通过我们公布的反馈与报错等措施将您的更正/修改申请提交给我们，要求我们更正或修改您的数据，但法律法规另有规定的除外。但出于安全性和身份识别的考虑，您可能无法修改注册时提交的某些初始注册信息。
  （三）删除权
   一般而言，我们只会在法律法规规定或必需且最短的时间内保存您的个人信息。为便于您行使您的上述删除权，我们为您提供了在线自行删除和向我们提出删除申请两种方式。
   对于您的部分个人信息，我们在产品的相关功能页面为您提供了操作指引和操作设置，您可以直接进行删除，一旦您删除后，我们即会对此类信息进行删除或匿名化处理，除非法律法规另有规定。
   在以下情形下，您可以直接向我们提出删除您个人信息的请求，但已做数据匿名化处理或法律法规另有规定的除外。
   我们违反法律法规规定，收集、使用您的个人信息的；
   我们违反了与您的约定，收集、使用您的个人信息的；
   法律法规等规定的其他情形。
   关于您不再使用我们提供的产品与/或服务且注销星若云手机账号后、以及我们终止部分或全部产品与/或服务后我们对您的个人信息的处理，我们将在本文其他专门章/节中为您详细作出说明。
   您理解并同意：当您从我们的产品与/或服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。
  （四）索取权
   如您需要您的个人数据的副本，您可以通过本《星若云手机隐私政策》文末提供的方式联系我们，在核实您的身份后，我们将向您提供您在我们的服务中的个人信息副本（包括基本资料、身份信息），但法律法规另有规定的或本政策另有约定的除外。
  （五）撤回同意权
   如您想更改相关权限的授权（例如：位置、通讯录、相机、相册、麦克风、日历），您可以通过您的硬件设备进行修改、或在我们的产品或服务中的相关功能设置界面进行操作处理（例如：“位置”权限在“手机端星若云手机APP”中的撤回同意路径为：我的—设置—隐私—隐私设置）。您也可以通过注销星若云手机账号的方式，永久撤回我们继续收集您个人信息的全部授权。如您在此过程中遇到操作问题的，可以通过本《星若云手机隐私政策》文末提供的方式联系我们。
   当您取消相关个人信息收集的授权后，我们将不再收集该信息，也无法再为您提供上述与之对应的服务；但您知悉并同意，除非您行使前述“ 删除权”，否则您的该行为不会影响我们基于您之前的授权进行的个人信息的处理、存储。
  （六）注销权
   我们为您提供星若云手机账号注销权限，您可以通过在线申请注销或联系我们的客服或通过其他我们公示的方式注销您的账号（但法律法规另有规定的或本政策另有约定的除外），一旦您注销账号，将无法使用我们提供的全线用户产品的服务且视为自动放弃已有的权益，因此请您谨慎操作。除法律法规另有规定外，注销账号之后，我们将停止为您提供我们所有的产品和服务，您曾通过该账号使用的我们的产品与服务下的所有内容、信息、数据、记录将会被删除或匿名化处理。
   如您在谨慎考虑后仍执意决定注销您的星若云手机账号的，您可以在您使用的我们的产品与/或服务的相关功能设置页面或根据操作指引向我们提交注销申请。
  （七）提前获知产品与/或服务停止运营权
   我们将持续为您提供优质服务，若因特殊原因导致我们的部分或全部产品与/或服务被迫停止运营，我们将提前在显著位置或向您发送推送消息或以其他方式通知您，并将停止对您个人信息的收集，同时在超出法律法规规定的必需且最短期限后，我们将会对所持有的您的个人信息进行删除或匿名化处理。
  （八）帮助反馈权
   我们为您提供了多种反馈渠道，具体请见本政策“如何联系我们”章节。
   例外情形
   请您理解并知悉，根据法律法规等规定，在下述情况下，我们可能不会响应您的关于访问、更正/修改权、删除权、撤回同意权、注销权、索取权的请求：
   与国家安全、国防安全有关的；
   与公共安全、公共卫生、重大公共利益有关的；
   与犯罪侦查、起诉、审判和判决执行等有关的；
   我们有充分证据表明您存在主观恶意或滥用权利的；
   响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
   涉及商业秘密的；
   法律法规等规定的其他情形。  

六、我们如何存储和保护您的个人信息
   （一）个人信息的存储 存储地点：我们依照法律法规的规定，将您的个人信息存储于中华人民共和国境内。目前我们暂时不存在跨境存储您的个人信息或向境外提供个人信息的场景。如需跨境存储或向境外提供个人信息的，我们会单独向您明确告知（包括出境的目的、接收方、使用方式与范围、使用内容、安全保障措施、安全风险等）并再次征得您的授权同意，并严格要求接收方按照本《星若云手机隐私政策》以及其他相关要求来处理您的个人信息； 存储期限：我们在为提供我们的产品和服务之目的所必需且最短的期间内保留您的个人信息，例如：当您使用我们的注册及会员功能时，我们需要收集您的手机号码，且在您提供后并在您使用该功能期间，我们需要持续为您保留您的手机号码，以向您正常提供该功能、保障您的账号和系统安全。在超出上述存储期限后，我们会对您的个人信息进行删除或匿名化处理。但您行使删除权、注销账户的或法律法规另有规定的除外（例如：《电子商务法》规定：商品和服务信息、交易信息保存时间自交易完成之日起不少于三年）。  说明：如您申请注销星若云手机账号且已成功向我们提交注销申请的，在此期间内，我们为您的该账号提供60天的保留期限（即“冻结期”）。在该冻结期内，为便于您申请恢复该账号，该账号下的相关信息我们暂时不会作删除或匿名化处理。如超过冻结期后，我们未收到您恢复账号的请求或者未出现任何其他不得注销事由的，该账号将被永久注销，该账号下的相关信息我们会作删除或匿名化处理。
   （二）个人信息的保护措施 我们一直都极为重视保护用户的个人信息安全，为此我们采用了符合行业标准的安全技术措施及配套的组织架构和管理体系等多层面保护措施以最大程度降低您的信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。包括： 数据安全技术措施
   （1）数据安全收集方面，通过个人信息安全影响评估确认数据收集的合法性、正当性和必要性，识别并以清晰、准确的方式告知用户以征得同意，同时对用户的授权同意采集行为进行日志记录；采用敏感识别工具对收集的用户数据进行分类分级，针对不同级别的数据设置不同等级的安全策略；采用技术措施对收集或产生数据的来源方进行身份识别，确保数据来源的准确性和抗抵赖性；
   （2） 数据安全传输方面，使用安全通道传输个人信息，并通过合适的加密算法进行安全加密、脱敏处理，确保数据传输过程中个人信息的秘密性和完整性；
   （3）数据安全存储方面，采用数据分类分级管理制度，针对数据分类分级结果采取不同的信息存储策略；采用数据分类分级管理制度，针对数据分类分级结果采取不同的信息存储策略；个人敏感信息需加密存储，确保数据安全使用规范能够落实到位；针对存储有个人信息的数据库加强权限控制与安全审计；定期对个人信息进行备份与恢复，确保个人信息在存储使用过程中的完整性；
   （4）数据安全处理方面，依照使用场景和安全需求对个人信息进行脱敏处理，例如：在前端显示个人敏感信息之前需在服务端完成脱敏处理；开发、测试环境严禁使用真实用户信息；实施严格的数据权限控制机制，采取多重身份认证、网络/数据隔离等技术措施，确保能够对处理个人信息的行为进行有效监控，避免数据被违规访问和未授权使用；
   （5）数据安全销毁方面，根据法律法规要求和业务实际需求设定个人信息存储的最小可用期限，对到期的数据通过安全删除技术进行处理，确保已销毁数据不可恢复，技术手段包括但不限于数据彻底清除方案、磁盘销毁、物理销毁等；
   （6） 建立完整的审计机制，对数据生命周期的全流程进行监控与审计，防止您的个人信息遭遇未经授权的访问、公开披露、使用、修改、人为或意外的损坏或丢失；
   （7） 其他实现数据安全保护的措施。
	数据安全组织和管理措施
   （1）成立专门的个人信息保护责任部门，建立相关的内控管理流程，对可能接触到您的信息的工作人员采取最小化权限原则；
   （2）建立数据分类分级制度、业务数据安全使用规范、数据合作规范等管理体系，保障您的信息在收集、传输、使用、存储、转移、销毁等环节的处置满足法律法规相关规范和安全要求；
   （3）定期组织员工参加安全与隐私保护相关培训并要求完成规定的考核，加强员工对于保护个人信息重要性的认知；
   （4）通过公安部信息安全等级保护三级认证，并与监管机构、第三方测评机构建立了良好的协调联动机制，及时抵御并处置各类信息安全威胁，为您的信息安全提供全方位保障；
   （5）其他可行的安全组织和管理措施。
	合作协议条款保证
   （1）在我们从第三方间接收集您的个人信息前，我们会明确以书面形式（如合作协议、承诺书）要求该第三方在已经取得您明示同意后收集以及处理（如共享等）个人信息，在书面协议层面要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求该第三方承担相应法律责任；
   （2）在我们向业务合作伙伴共享您的个人信息前，我们会严格要求合作伙伴的信息保护义务与责任，并要求业务合作伙伴在合作前签署关于数据安全的保护协议，一旦业务合作伙伴有任何违反协议的行为，将须承担相应法律责任；
   （3）其他合作协议中明确约定的内容。
	安全事件的处理
   （1）我们建立了合理有效、科学健全的安全应急响应体系，制定了《网络安全事件应急响应预案》、《紧急安全事件响应机制》、《重大事件应急预案》、《数据安全事件管理规范》等多项安全管理制度，明确了网络安全事件的分类分级标准、安全应急响应组织及职责，并根据安全事件的不同类型和级别制定了适当的应急响应预案，明确规范了安全事件的报告流程和应急响应处置流程（包括研判、分析、抑制、根除、恢复、结果公布和经验总结）。
   （2）如不幸发生个人信息安全事件的，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、电话、短信、推送通知、信件等一种或多种方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况；
   （3）请您知悉并理解，互联网并非绝对安全的环境，我们强烈建议您通过安全方式、使用复杂密码，协助我们保证您的账号安全。如您发现自己的个人信息泄密，尤其是您的账户或密码发生泄露，请您立即根据本隐私政策文末中提供的联系方式联络我们，以便我们采取相应措施来保护您的信息安全。

七、未成年人保护
	星若云手机一直非常注重对未成年人的保护，致力于践行我们的企业社会责任。 星若云手机的绝大部分产品与/或服务主要面向成年人提供，针对这部分产品与/或服务，我们不会主动直接向未成年人收集其个人信息，如未成年人需要使用的，应首先取得其监护人的同意（包括本政策），在监护人同意后和指导下进行使用、提交个人信息；我们希望监护人亦能积极的教育和引导未成年人增强个人信息保护意识和能力，保护未成年人个人信息安全。星若云手机会严格履行法律规定的未成年人保护义务与责任，我们只会在法律允许、监护人同意或保护未成年人所必要的情况下收集、使用、共享、转让或披露未成年人个人信息，如果我们发现未成年人在未事先获得其监护人同意的情况下使用了我们的产品与/或服务的，我们会尽最大努力与监护人取得联系，并在监护人要求下尽快删除相关未成年人个人信息。此外，对于在运营中可能涉及的儿童个人信息，我们会根据实际情况适用本政策附件一《星若云手机儿童个人信息保护规则》。 星若云手机的部分产品与/或服务为独立儿童APP，其主要面向儿童群体并为儿童提供专属内容，针对这部分产品与/或服务，儿童在使用前应首先取得其监护人的同意（包括本政策，尤其是本政策附件一），在监护人同意后和指导下进行使用。我们会严格履行法律规定的儿童个人信息保护义务与责任，关于我们对儿童个人信息的收集、使用、存储、保护规则等，我们制定了专门的条款，请监护人仔细阅读本政策附件一《星若云手机儿童个人信息保护规则》。

八、本《星若云手机隐私政策》的更新
   我们鼓励您在每次使用我们的产品或服务时都查阅我们的《星若云手机隐私政策》。为了给您提供更好的服务，我们会根据产品的更新情况及法律法规的相关要求更新本《星若云手机隐私政策》的条款，该等更新构成本《星若云手机隐私政策》的一部分。如该等更新造成您在本《星若云手机隐私政策》下权利的实质减少或重大变更，我们将在本政策生效前通过在显著位置提示或向您发送推送消息或以其他方式通知您，若您继续使用我们的服务，即表示您充分阅读、理解并同意受经修订的《星若云手机隐私政策》的约束。为保障您的合法权益，我们建议您可以定期在我们平台的设置页面中查看本政策。 上述的“重大变更”包括但不限于： 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等； 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等； 个人信息共享、转让或公开披露的主要对象发生变化； 您参与个人信息处理方面的权利及其行使方式发生重大变化； 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时； 个人信息安全影响评估报告表明存在高风险时； 其他重要的或可能严重影响您的个人权益的情况发生时。

九、如何联系我们
   （一）如您对本《星若云手机隐私政策》的执行或使用我们的服务时遇到的与隐私保护相关的事宜有任何问题（包括问题咨询、投诉等），我们专门为您提供了多种反馈通道，希望为您提供满意的解决方案： 在线意见反馈通道：您可与我们平台上产品功能页面提交意见反馈； 人工客服通道：您可以拨打我们的任何一部客服电话与我们联系； 专设的邮件通道：为更好地保护您的权益，我们专门设立了ldq@ldmnq.com邮箱，您可以通过该邮箱与我们联系；
   （二）我们会在收到您的意见及建议后，并在验证您的用户身份后的30日内或法律法规规定的期限内尽快向您回复，一般情况下，我们不会因此对您收取服务费。但是，在以下情形下，您理解并知悉，我们将无法响应您的请求： 与国家安全、国防安全有关的； 与公共安全、公共卫生、重大公共利益有关的； 与犯罪侦查、起诉和审判等有关的； 有充分证据表明您存在主观恶意或滥用权利的； 响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的； 涉及商业秘密的； 法律法规等规定的其他情形。
   （三）如果您对我们的回复不满意，或我们对您个人信息的处理方式侵害了您的合法权益，且在您向我们反馈后我们仍拒绝改进的，您可以向工商、公安等监管部门进行投诉、举报。  

十、其他
  （一）本《星若云手机隐私政策》的解释及争议解决均应适用中华人民共和国大陆地区法律。与本《星若云手机隐私政策》相关的任何纠纷，双方应协商友好解决；若不能协商解决，您同意将争议提交至北京市海淀区人民法院诉讼解决。
  （二）本《星若云手机隐私政策》的标题仅为方便及阅读而设，并不影响正文其中任何规定的含义或解释。
   星若云手机
   附件一：星若云手机儿童个人信息保护规则 
   星若云手机一直非常注重对未成年人的保护，致力于践行我们的企业社会责任。本《星若云手机儿童个人信息保护规则》（以下也称“本规则”）旨在更详细的向监护人（以下也称“您”）和儿童说明我们如何收集、使用、存储和处理儿童个人信息，以及我们为您与儿童提供的访问、更正、删除、保护这些信息的方式。如果您是儿童用户的监护人，请您仔细阅读、充分理解并决定选择是否同意本规则以及是否同意您和您监护的儿童使用我们的产品与/或服务。
   一. 适用范围 本《星若云手机儿童个人信息保护规则》（以下也称“本规则”）仅适用于主要面向儿童群体并为儿童提供专属内容的独立儿童APP（本规则中也称“儿童APP”）。《星若云手机隐私政策》展示了星若云手机收集、使用、处理、保护个人信息的一般做法，本规则为《星若云手机隐私政策》的一部分；如在儿童个人信息保护规则方面，本规则与《星若云手机隐私政策》正文存在不一致的，本规则优先适用，如本规则中未提及的，则视产品实际情况适用/参照适用《星若云手机隐私政策》正文执行或以星若云手机另行说明为准。除非本规则另有说明，本规则中涉及的词语含义与《星若云手机隐私政策》正文中的一致。
   二. 我们收集和使用儿童个人信息的规则 我们会严格履行法律规定的儿童个人信息保护义务与责任，遵循正当必要、知情同意、目的明确、安全保障、依法利用的原则收集和使用儿童个人信息，不会收集与我们提供的产品与/或服务无关的儿童个人信息，不会违反法律规定和我们与您的约定收集、使用儿童个人信息。 我们收集和使用的儿童个人信息类型包括两种：第一种：儿童APP的核心业务功能所必需的信息：此类信息为儿童APP正常运行的必备信息，您须授权我们收集。如您拒绝提供，您和儿童将无法正常使用我们的产品与/或服务；第二种：儿童APP的附加业务功能可能需要收集的信息：此信息为非核心业务功能所需的信息，您可以选择是否授权我们收集。如您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的服务效果，但不影响您和儿童对核心业务功能的正常使用。 在儿童使用儿童APP的过程中，我们会收集上网操作记录（包括购买记录、搜索记录、下载记录、收藏记录、点击记录），我们收集这些信息是为了向您披露您监护的儿童的日常使用情况，同时为儿童提供其需要的内容和可能更感兴趣的服务，同时改进我们的产品和服务。 此外，我们可能会收集和使用的儿童的其他个人信息的规则请您查阅《星若云手机隐私政策》正文第二章节，该内容将视儿童APP实际情况适用/参照适用。因业务需要，当确需超出前述约定的目的、范围收集、使用您监护的儿童的个人信息的，我们会再次征得您的同意。
   三. 我们共享、转让、公开披露儿童个人信息的规则
   (一) 共享 对于儿童个人信息，我们仅在本规则所述的目的和范围内或依照法律要求进行共享，除非存在以下一种或多种情形： 与作为监护人的您之间的共享； 事先已征得您的明确授权同意； 为了必要/合理的业务的顺利开展、满足您和儿童的要求、履行我们在相关用户协议或本规则中的义务和行使我们的权利或遵守法律规定等目的，与为我们的儿童APP提供功能支持的服务提供商的必要共享，但我们承诺我们只会共享儿童必要个人信息，如果我们需要改变儿童个人信息的处理目的时，将再次征求您的授权同意。请您放心，我们会对服务商和其服务行为等进行安全评估，签署协议，明确责任、处理事项、处理期限、处理性质和目的等，要求其处理行为不得超出我们的授权范围； 有权机关的要求、法律法规等规定的其他情形。
   (二) 转让与公开披露 我们会严格履行法律规定的儿童个人信息保护义务与责任，遵循正当必要、知情同意、目的明确、安全保障、依法利用的原则转让、公开披露儿童个人信息。如您希望了解更多，请您查阅《星若云手机隐私政策》正文第四章节。 四. 您及/或儿童对儿童个人信息的控制权 我们在儿童APP中为您和儿童提供了多种对儿童个人信息行使控制权的功能，您可以通过这些功能管理儿童个人信息和儿童的网络生活，包括：
   (一) 访问权 您或儿童可以在儿童APP中查询和访问儿童的相关个人信息，例如：个人资料信息、购买记录、搜索记录、收藏记录。
   (二) 更正/修改权 您可以在儿童APP中更正/修改儿童的相关个人信息，例如：个人资料信息；或您可以联系我们解决，我们会在经对您的身份进行验证，且不影响信息的客观性和准确性的情况下进行更正/修改。但出于安全性和身份识别的考虑，您可能无法修改注册时提交的某些初始注册信息。 同时，如您或儿童发现我们收集、存储、使用、披露的儿童个人信息有错误的，可以联系我们更正，我们会在完成身份验证和核实问题后及时采取措施予以更正。
   (三) 删除权 您和儿童可以在儿童APP中自行删除儿童的相关个人信息，例如：搜索记录、下载记录、收藏记录。但请注意，若您和儿童自行删除或请求我们删除特定的儿童个人信息（如注册账号），可能导致无法继续使用我们的全部或部分产品与/或服务。 在以下情形下，您或儿童可以直接向我们提出删除儿童个人信息的请求，我们会在完成身份验证和核实问题后及时采取措施予以删除，包括： 我们违反法律法规规定或我们与您的约定收集、存储、使用、转移、披露儿童个人信息的； 我们超出目的范围或者必要期限收集、存储、使用、转移、披露儿童个人信息的； 您撤回同意的； 您或儿童通过注销等方式终止使用我们的儿童APP的； 法律法规等规定的其他情形。
   (四) 提前获知产品与/或服务停止运营权 我们将持续为您提供优质服务，若因特殊原因导致我们的部分或全部产品与/或服务被迫停止运营，我们将提前在显著位置或向您发送推送消息或以其他方式通知您，并将停止对儿童个人信息的收集，删除或匿名化处理我们持有的儿童个人信息。
   (五) 我们存储和保护儿童个人信息的规则 我们依照法律法规的规定，将儿童个人信息存储于中华人民共和国境内。我们仅在为提供我们的产品和服务之目的所必需且最短的期间内保留儿童个人信息。在超出上述存储期限后，我们会对儿童个人信息进行删除或匿名化处理。 我们采用了符合行业标准的安全技术措施及配套的组织架构和管理体系等多层面保护措施来保护儿童个人信息；同时，我们遵循最小授权原则，对工作人员设定了严格的信息访问权限，控制儿童个人信息知悉范围；我们也采取了必要技术措施，避免违法复制、下载儿童个人信息。如您希望了解更多，请您查阅《星若云手机隐私政策》正文第六章节。
   (六) 如何联系我们 如您对本规则的执行或使用儿童APP时遇到的与儿童隐私保护相关的事宜有任何问题（包括问题咨询、投诉等），您可以通过ldq@ldmnq.com与我们联系，我们有专门人员负责对接；您也可以通过《星若云手机隐私政策》正文第九章节中提供的其他反馈通道与我们联系，我们会尽最大努力为您提供满意的解决方案。
</pre>
`
module.exports = {
	agreement,
	privacypoli
}





